size of test_var is torch.Size([2, 16, 544, 384])
size of x1 torch.Size([2, 16, 544, 384])
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [1, 16, 544, 384]             448
       BatchNorm2d-2          [1, 16, 544, 384]              32
              ReLU-3          [1, 16, 544, 384]               0
            Conv2d-4          [1, 16, 544, 384]           2,320
       BatchNorm2d-5          [1, 16, 544, 384]              32
              ReLU-6          [1, 16, 544, 384]               0
         MaxPool2d-7          [1, 16, 272, 192]               0
            Conv2d-8          [1, 32, 272, 192]           4,640
       BatchNorm2d-9          [1, 32, 272, 192]              64
             ReLU-10          [1, 32, 272, 192]               0
           Conv2d-11          [1, 32, 272, 192]           9,248
      BatchNorm2d-12          [1, 32, 272, 192]              64
             ReLU-13          [1, 32, 272, 192]               0
        MaxPool2d-14           [1, 32, 136, 96]               0
           Conv2d-15           [1, 64, 136, 96]          18,496
      BatchNorm2d-16           [1, 64, 136, 96]             128
             ReLU-17           [1, 64, 136, 96]               0
           Conv2d-18           [1, 64, 136, 96]          36,928
      BatchNorm2d-19           [1, 64, 136, 96]             128
             ReLU-20           [1, 64, 136, 96]               0
        MaxPool2d-21            [1, 64, 68, 48]               0
           Conv2d-22           [1, 128, 68, 48]          73,856
      BatchNorm2d-23           [1, 128, 68, 48]             256
             ReLU-24           [1, 128, 68, 48]               0
           Conv2d-25           [1, 128, 68, 48]         147,584
      BatchNorm2d-26           [1, 128, 68, 48]             256
             ReLU-27           [1, 128, 68, 48]               0
        MaxPool2d-28           [1, 128, 34, 24]               0
           Conv2d-29           [1, 256, 34, 24]         295,168
      BatchNorm2d-30           [1, 256, 34, 24]             512
             ReLU-31           [1, 256, 34, 24]               0
           Conv2d-32           [1, 256, 34, 24]         590,080
      BatchNorm2d-33           [1, 256, 34, 24]             512
             ReLU-34           [1, 256, 34, 24]               0
  ConvTranspose2d-35           [1, 128, 68, 48]         131,200
           Conv2d-36           [1, 128, 68, 48]         295,040
      BatchNorm2d-37           [1, 128, 68, 48]             256
             ReLU-38           [1, 128, 68, 48]               0
           Conv2d-39           [1, 128, 68, 48]         147,584
      BatchNorm2d-40           [1, 128, 68, 48]             256
             ReLU-41           [1, 128, 68, 48]               0
  ConvTranspose2d-42           [1, 64, 136, 96]          32,832
           Conv2d-43           [1, 64, 136, 96]          73,792
      BatchNorm2d-44           [1, 64, 136, 96]             128
             ReLU-45           [1, 64, 136, 96]               0
           Conv2d-46           [1, 64, 136, 96]          36,928
      BatchNorm2d-47           [1, 64, 136, 96]             128
             ReLU-48           [1, 64, 136, 96]               0
  ConvTranspose2d-49          [1, 32, 272, 192]           8,224
           Conv2d-50          [1, 32, 272, 192]          18,464
      BatchNorm2d-51          [1, 32, 272, 192]              64
             ReLU-52          [1, 32, 272, 192]               0
           Conv2d-53          [1, 32, 272, 192]           9,248
      BatchNorm2d-54          [1, 32, 272, 192]              64
             ReLU-55          [1, 32, 272, 192]               0
  ConvTranspose2d-56          [1, 16, 544, 384]           2,064
           Conv2d-57          [1, 16, 544, 384]           4,624
      BatchNorm2d-58          [1, 16, 544, 384]              32
             ReLU-59          [1, 16, 544, 384]               0
           Conv2d-60          [1, 16, 544, 384]           2,320
      BatchNorm2d-61          [1, 16, 544, 384]              32
             ReLU-62          [1, 16, 544, 384]               0
           Conv2d-63          [1, 16, 544, 384]           2,320
      BatchNorm2d-64          [1, 16, 544, 384]              32
           Conv2d-65          [1, 16, 544, 384]           2,320
      BatchNorm2d-66          [1, 16, 544, 384]              32
           Conv2d-67          [1, 16, 544, 384]           2,320
      BatchNorm2d-68          [1, 16, 544, 384]              32
             ReLU-69          [1, 16, 544, 384]               0
           Conv2d-70          [1, 16, 544, 384]           2,320
      BatchNorm2d-71          [1, 16, 544, 384]              32
             ReLU-72          [1, 16, 544, 384]               0
        MaxPool2d-73          [1, 16, 272, 192]               0
           Conv2d-74          [1, 32, 272, 192]           4,640
      BatchNorm2d-75          [1, 32, 272, 192]              64
             ReLU-76          [1, 32, 272, 192]               0
           Conv2d-77          [1, 32, 272, 192]           9,248
      BatchNorm2d-78          [1, 32, 272, 192]              64
             ReLU-79          [1, 32, 272, 192]               0
        MaxPool2d-80           [1, 32, 136, 96]               0
           Conv2d-81           [1, 64, 136, 96]          18,496
      BatchNorm2d-82           [1, 64, 136, 96]             128
             ReLU-83           [1, 64, 136, 96]               0
           Conv2d-84           [1, 64, 136, 96]          36,928
      BatchNorm2d-85           [1, 64, 136, 96]             128
             ReLU-86           [1, 64, 136, 96]               0
        MaxPool2d-87            [1, 64, 68, 48]               0
           Conv2d-88           [1, 128, 68, 48]          73,856
      BatchNorm2d-89           [1, 128, 68, 48]             256
             ReLU-90           [1, 128, 68, 48]               0
           Conv2d-91           [1, 128, 68, 48]         147,584
      BatchNorm2d-92           [1, 128, 68, 48]             256
             ReLU-93           [1, 128, 68, 48]               0
        MaxPool2d-94           [1, 128, 34, 24]               0
           Conv2d-95           [1, 256, 34, 24]         295,168
      BatchNorm2d-96           [1, 256, 34, 24]             512
             ReLU-97           [1, 256, 34, 24]               0
           Conv2d-98           [1, 256, 34, 24]         590,080
      BatchNorm2d-99           [1, 256, 34, 24]             512
            ReLU-100           [1, 256, 34, 24]               0
 ConvTranspose2d-101           [1, 128, 68, 48]         131,200
          Conv2d-102           [1, 128, 68, 48]         295,040
     BatchNorm2d-103           [1, 128, 68, 48]             256
            ReLU-104           [1, 128, 68, 48]               0
          Conv2d-105           [1, 128, 68, 48]         147,584
     BatchNorm2d-106           [1, 128, 68, 48]             256
            ReLU-107           [1, 128, 68, 48]               0
 ConvTranspose2d-108           [1, 64, 136, 96]          32,832
          Conv2d-109           [1, 64, 136, 96]          73,792
     BatchNorm2d-110           [1, 64, 136, 96]             128
            ReLU-111           [1, 64, 136, 96]               0
          Conv2d-112           [1, 64, 136, 96]          36,928
     BatchNorm2d-113           [1, 64, 136, 96]             128
            ReLU-114           [1, 64, 136, 96]               0
 ConvTranspose2d-115          [1, 32, 272, 192]           8,224
          Conv2d-116          [1, 32, 272, 192]          18,464
     BatchNorm2d-117          [1, 32, 272, 192]              64
            ReLU-118          [1, 32, 272, 192]               0
          Conv2d-119          [1, 32, 272, 192]           9,248
     BatchNorm2d-120          [1, 32, 272, 192]              64
            ReLU-121          [1, 32, 272, 192]               0
 ConvTranspose2d-122          [1, 16, 544, 384]           2,064
          Conv2d-123          [1, 16, 544, 384]           4,624
     BatchNorm2d-124          [1, 16, 544, 384]              32
            ReLU-125          [1, 16, 544, 384]               0
          Conv2d-126          [1, 16, 544, 384]           2,320
     BatchNorm2d-127          [1, 16, 544, 384]              32
            ReLU-128          [1, 16, 544, 384]               0
          Conv2d-129           [1, 2, 544, 384]              34
================================================================
Total params: 3,894,674
Trainable params: 3,894,674
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 2.39
Forward/backward pass size (MB): 1391.34
Params size (MB): 14.86
Estimated Total Size (MB): 1408.59
----------------------------------------------------------------
